# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Application Path 
cask_args appdir: "/Applications"

# Binaries/Libraries
brew "python3"
brew "mas"

# Applications
cask "alfred"
cask "bartender"
cask "cheatsheet"
cask "discord"
cask "flux"
cask "google-chrome"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keka"
cask "macs-fan-control"
cask "mysqlworkbench"
cask "notion"
cask "postman"
cask "pycharm"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "zoom"

# Applications from App store
mas "KakaoTalk", id:869223134
mas "Magnet", id:441258766
mas "Xcode", id:497799835
mas "한컴오피스 한글 2014 VP 뷰어", id:416746898
mas "Keynote", id:409183694
mas "Pages", id:409201541
mas "Numbers", id:409203825

# fonts
cask 'homebrew/cask-fonts/font-d2coding'
cask 'homebrew/cask-fonts/font-hack'
cask 'homebrew/cask-fonts/font-meslo-lg'
cask 'homebrew/cask-fonts/font-meslo-for-powerline'
cask 'homebrew/cask-fonts/font-nanumgothic'



