# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Application Path 
cask_args appdir: "/Applications"

# Binaries/Libraries
brew "mas"

# Applications
cask "1password"
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "cheatsheet"
cask "discord"
cask "flux"
cask "google-chrome"
cask "intellij-idea"
cask "istat-menus"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keka"
cask "macs-fan-control"
cask "millie"
cask "mysqlworkbench"
cask "notion"
cask "postman"
cask "pycharm"
cask "slack"
cask "steam"
cask "telegram"
cask "visual-studio-code"
cask "webstorm"
cask "zoom"

# fonts
cask 'font-d2coding'
cask 'font-hack'
cask 'font-meslo-lg'
cask 'font-meslo-for-powerline'
cask 'font-nanumgothic'

# Applications from App store
mas "Bluetooth MIDI Connect", id: 1074606480
mas "Developer", id: 640199958
mas "Final Cut Pro", id: 424389933
mas "Hancom Office HWP 2014 VP Viewer", id: 416746898
mas "KakaoTalk", id:869223134
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Magnet", id:441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Snappy", id: 512617038
mas "Xcode", id:497799835
